# Pandas

### Data Frame

A pandas DataFrame represents a two-dimensional dataset, characterized by labeled rows and columns, making it a versatile and immutable tabular structure. It comprises three essential components: the data itself, along with its rows and columns.

* DataFrames support named rows & columns (you can also provide names to rows)
* Supports heterogeneous collections of data.
* DataFrame labeled axes (rows and columns).
* Can perform arithmetic operations on rows and columns.
* Supporting reading flat files like CSV, Excel, and JSON and also reads SQL tables’s
* Handling of missing data.

In [13]:
import pandas as pd
import numpy as np

In [8]:
technologies = [("Spark",20000, "30days"), 
                ("pandas",20000, "40days"), 
               ]
df=pd.DataFrame(technologies)
print(df)

print('-----------------')

schema = ['Technology', 'salary', 'Time_to_learn']
df1 = pd.DataFrame(columns=schema, data=technologies)
print(df1)

print('-----------------')

row_label = ['a', 'b']
df2 = pd.DataFrame(columns=schema, data=technologies, 
                    index=row_label)
print(df2)

        0      1       2
0   Spark  20000  30days
1  pandas  20000  40days
-----------------
  Technology  salary Time_to_learn
0      Spark   20000        30days
1     pandas   20000        40days
-----------------
  Technology  salary Time_to_learn
a      Spark   20000        30days
b     pandas   20000        40days

In [10]:
df2.dtypes

Technology       object
salary            int64
Time_to_learn    object
dtype: object

In [12]:
# Create DataFrame from Dictionary
technologies = {
    'Courses':["Spark","PySpark","Hadoop"],
    'Fee' :[20000,25000,26000],
    'Duration':['30day','40days','35days'],
    'Discount':[1000,2300,1500]
              }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1500

In [14]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)
print(df)

    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
r2   Hadoop  23000.0   55days      1000
r3   Python  24000.0   40days      1200
r4   Pandas      NaN   60days      2500
r5     None  25000.0    35day      1300
r6    Spark  25000.0               1400
r7   Python  22000.0   50days      1600

### DataFrame properties

Method/Property	Result	Description
* df.shape	(8, 4)	Returns a shape of the pandas DataFrame (number of rows and columns) as a tuple. Number of rows and columns
* df.size	32	Returns number of cells. It would be rows * columns.
* df.empty	False	Return boolean. True when DF is empty.
* df.columns	Index([‘Courses’, ‘Fee’, ‘Duration’, ‘Discount’], dtype=’object’)	Returns all column names as Series
* df.columns.values	[‘Courses’ ‘Fee’ ‘Duration’ ‘Discount’]	Returns column names from the header as a list in pandas.
* df.index	Index([‘r0’, ‘r1’, ‘r2’, ‘r3’, ‘r4’, ‘r5’, ‘r6’, ‘r7′], dtype=’object’)	Returns Index of DataFrame
* df.index.values	[‘r0’ ‘r1’ ‘r2’ ‘r3’ ‘r4’ ‘r5’ ‘r6’ ‘r7’]	Returns Index as List.
* df.dtypes	Courses object
Fee float64
Duration object
Discount int64
dtype: object	Returns Data types of columns
* df['Fee']
df[['Fee','Duration']]	r0 22000.0
r1 25000.0
r2 23000.0
r3 24000.0
r4 NaN
r5 25000.0
r6 25000.0
r7 22000.0
Name: Fee, dtype: float64	Pandas Select Columns by Name.
Also, use to select multiple columns
* df2=df[df['Fee'] == 22000]	Courses Fee Duration Discount
r0 Spark 22000.0 30day 1000
r7 Python 22000.0 50days 1600	Filter DataFrame
* df2=df[6:]	Courses Fee Duration Discount
r6 Spark 25000.0 30day 1400
r7 Python 22000.0 50days 1600	Select Dataframe Rows by Index
Select’s Row from 6th Index
* df['Duration'][3]
df["Duration"].values[3]	40days	Get cell value (row x column) of DataFrame
* df['Fee'] = df['Fee'] - 500
df['Fee']	r0 21500.0
r1 24500.0
r2 22500.0
r3 23500.0
r4 NaN
r5 24500.0
r6 24500.0
r7 21500.0	Update DataFrame Column
Substract 500 from ‘Fee’ Column
* df[‘new_column’] = ”		Add new column with empty values

In [16]:
#describe() – describe function calculates count, mean, std, min, 
#             max, and different percentages of each numeric 
#             column of pandas DataFrame.

df.describe()

                Fee     Discount
count      7.000000     8.000000
mean   23714.285714  1537.500000
std     1380.131119   570.557372
min    22000.000000  1000.000000
25%    22500.000000  1150.000000
50%    24000.000000  1350.000000
75%    25000.000000  1775.000000
max    25000.000000  2500.000000

In [18]:
#read csv file

customers = pd.read_csv('customers-100.csv')
customers.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [20]:
print(df)

    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
r2   Hadoop  23000.0   55days      1000
r3   Python  24000.0   40days      1200
r4   Pandas      NaN   60days      2500
r5     None  25000.0    35day      1300
r6    Spark  25000.0               1400
r7   Python  22000.0   50days      1600

In [42]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)

# Filter Rows using query

df.query("Courses == 'Spark'", inplace=True)
df.query("Courses != 'Spark'")
df.query("Courses in ('Spark','PySpark')")
df.query("Fee >= 22000 and Fee <= 24000 ")

   Courses      Fee Duration  Discount
r0   Spark  22000.0    30day      1000

In [46]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)

# Filter rows using .loc[]
df.loc[df['Courses'] != 'Spark']
df.loc[df['Courses'] == 'Spark']
df.loc[df['Courses'].isin(['Spark'])]
df.loc[(df['Discount'] >= 1000) & (df['Discount'] <= 2000)]

   Courses      Fee Duration  Discount
r0   Spark  22000.0    30day      1000
r2  Hadoop  23000.0   55days      1000
r3  Python  24000.0   40days      1200
r5    None  25000.0    35day      1300
r6   Spark  25000.0               1400
r7  Python  22000.0   50days      1600

In [57]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)

# Using apply()
df.apply(lambda row: row[df['Courses'].isin(['Spark','Python'])])

# Other ways to filter 
df[df["Courses"] == 'Spark'] 
# df[df['Courses'].str.contains("Spark")]
# df[df['Courses'].str.lower().str.contains("spark")]
# df[df['Courses'].str.startswith("P")]

   Courses      Fee Duration  Discount
r0   Spark  22000.0    30day      1000
r6   Spark  25000.0               1400

In [58]:
# Insert Rows and Columns

df = pd.DataFrame(technologies, index=row_labels)

# Adds new column 'TutorsAssigned' to DataFrame
tutors = ['William', 'Henry', 'Michael', 'John', 
          'Messi', 'Ramana','Kumar','Vasu']

df2 = df.assign(TutorsOfCourse=tutors)
print(df2)

    Courses      Fee Duration  Discount TutorsOfCourse
r0    Spark  22000.0    30day      1000        William
r1  PySpark  25000.0   50days      2300          Henry
r2   Hadoop  23000.0   55days      1000        Michael
r3   Python  24000.0   40days      1200           John
r4   Pandas      NaN   60days      2500          Messi
r5     None  25000.0    35day      1300         Ramana
r6    Spark  25000.0               1400          Kumar
r7   Python  22000.0   50days      1600           Vasu

In [73]:
# Add a new column from existing column with Lambda

df2 = df.assign(Discounted_Fee = lambda x: x.Fee - x.Discount)
print(df2)

    Courses      Fee Duration  Discount  Discounted_Fee
r0    Spark  22000.0    30day      1000         21000.0
r1  PySpark  25000.0   50days      2300         22700.0
r2   Hadoop  23000.0   55days      1000         22000.0
r3   Python  24000.0   40days      1200         22800.0
r4   Pandas      NaN   60days      2500             NaN
r5     None  25000.0    35day      1300         23700.0
r6    Spark  25000.0               1400         23600.0
r7   Python  22000.0   50days      1600         20400.0

In [74]:
# Add new column at the beginning
# Adds new column 'TutorsAssigned' to DataFrame
tutors_duplicate = ['William', 'Henry', 'Michael', 'John', 
          'Messi', 'Ramana','Kumar','Vasu']
df2.insert(0,'TutorNewCol', tutors_duplicate)
print(df2)

   TutorNewCol  Courses      Fee Duration  Discount  Discounted_Fee
r0     William    Spark  22000.0    30day      1000         21000.0
r1       Henry  PySpark  25000.0   50days      2300         22700.0
r2     Michael   Hadoop  23000.0   55days      1000         22000.0
r3        John   Python  24000.0   40days      1200         22800.0
r4       Messi   Pandas      NaN   60days      2500             NaN
r5      Ramana     None  25000.0    35day      1300         23700.0
r6       Kumar    Spark  25000.0               1400         23600.0
r7        Vasu   Python  22000.0   50days      1600         20400.0

In [81]:
# Rename DataFrame Columns

df = pd.DataFrame(technologies, index=row_labels)

df.columns = ['A','B','C','D']
# Change column name by index. This changes 3rd column 
df.columns.values[2] = "Z"
print(df)
print('------------------------------------')
df2 = df.rename({'A': 'a', 'B': 'b'}, axis='columns')
print(df2)

          A        B       Z     D
r0    Spark  22000.0   30day  1000
r1  PySpark  25000.0  50days  2300
r2   Hadoop  23000.0  55days  1000
r3   Python  24000.0  40days  1200
r4   Pandas      NaN  60days  2500
r5     None  25000.0   35day  1300
r6    Spark  25000.0          1400
r7   Python  22000.0  50days  1600
------------------------------------
          a        b       Z     D
r0    Spark  22000.0   30day  1000
r1  PySpark  25000.0  50days  2300
r2   Hadoop  23000.0  55days  1000
r3   Python  24000.0  40days  1200
r4   Pandas      NaN  60days  2500
r5     None  25000.0   35day  1300
r6    Spark  25000.0          1400
r7   Python  22000.0  50days  1600

In [92]:
# Drop DataFrame Rows

df = pd.DataFrame(technologies, index=row_labels)

df1 = df.drop(['r1','r2'])

print(df1)

# Delete Rows by position
df1=df.drop(df.index[[1,3]])

# Delete Rows by Index Range
df1=df.drop(df.index[2:])

print('------------df.index[2:]-----------------')
print(df1)

# Delete Rows by Index Range
df1=df.drop(df.index[:2])

print('--------------df.index[:2]---------------')
print(df1)

# Drop rows by checking conditions
df1 = df.loc[df["Discount"] >=1500 ]

print('------------df["Discount"] >=1500-------------')
print(df1)

# When you have default indexs for rows
#df1 = df.drop(0)
#df1 = df.drop([0, 3])
#df1 = df.drop(range(0,2))

   Courses      Fee Duration  Discount
r0   Spark  22000.0    30day      1000
r3  Python  24000.0   40days      1200
r4  Pandas      NaN   60days      2500
r5    None  25000.0    35day      1300
r6   Spark  25000.0               1400
r7  Python  22000.0   50days      1600
------------df.index[2:]-----------------
    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
--------------df.index[:2]---------------
   Courses      Fee Duration  Discount
r2  Hadoop  23000.0   55days      1000
r3  Python  24000.0   40days      1200
r4  Pandas      NaN   60days      2500
r5    None  25000.0    35day      1300
r6   Spark  25000.0               1400
r7  Python  22000.0   50days      1600
------------df["Discount"] >=1500-------------
    Courses      Fee Duration  Discount
r1  PySpark  25000.0   50days      2300
r4   Pandas      NaN   60days      2500
r7   Python  22000.0   50days      1600

In [101]:
# Drop columns

df = pd.DataFrame(technologies, index=row_labels)
print(df)

# Delete Column by Name
df2=df.drop(["Fee"], axis = 1)

# Drop by using labels & axis
df2=df.drop(labels=["Fee"], axis = 1)
print('---------df.drop(labels=[Fee])------------')
print(df2)

# Drop by using columns
df2=df.drop(columns=["Fee"])

# Other ways to drop columns
df.drop(df.loc[:, 'Courses':'Duration'].columns, axis = 1, inplace=True)
print('---------df.loc[:, Courses:Duration].columns--------------')
print(df)

    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
r2   Hadoop  23000.0   55days      1000
r3   Python  24000.0   40days      1200
r4   Pandas      NaN   60days      2500
r5     None  25000.0    35day      1300
r6    Spark  25000.0               1400
r7   Python  22000.0   50days      1600
---------df.drop(labels=[Fee])------------
    Courses Duration  Discount
r0    Spark    30day      1000
r1  PySpark   50days      2300
r2   Hadoop   55days      1000
r3   Python   40days      1200
r4   Pandas   60days      2500
r5     None    35day      1300
r6    Spark               1400
r7   Python   50days      1600
---------df.loc[:, Courses:Duration].columns--------------
    Discount
r0      1000
r1      2300
r2      1000
r3      1200
r4      2500
r5      1300
r6      1400
r7      1600

In [112]:
# merge()

technologies1   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df1 = pd.DataFrame(technologies1, index=row_labels)

technologies2   = ({
    'Courses':["Spark","PySpark","AuroraDB","Python","DynamoDB",None,"Spark","Python"],
    'Fee' :[100,25000,12000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','5days'],
    'Discount':[1000,2300,500,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df2 = pd.DataFrame(technologies2, index=row_labels)

# pandas.merge()
#Only same data in both data frames are merged and printed in df3
#        even if one column is different its not merged
df3=pd.merge(df1,df2)
print('--------pd.merge(df1,df2)-----------')
print(df3)

# Merge by column
# More like cross join returns all the combinations
df3=pd.merge(df1,df2, on='Courses')
print('--------pd.merge(df1,df2, on=Courses)-----------')
print(df3)


# Merge by multiple columns
df3 = pd.merge(df1, df2,  how='left', left_on=['Courses','Discount'], right_on = ['Courses','Discount'])
print('--------left_on, right_on =[Courses,Discount]-----------')
print(df3)

# Merge by left join
# df3 = pd.merge(df1,df2, on='Courses', how='left')

--------pd.merge(df1,df2)-----------
   Courses      Fee Duration  Discount
0  PySpark  25000.0   50days      2300
1   Python  24000.0   40days      1200
2     None  25000.0    35day      1300
3    Spark  25000.0               1400
--------pd.merge(df1,df2, on=Courses)-----------
   Courses    Fee_x Duration_x  Discount_x    Fee_y Duration_y  Discount_y
0    Spark  22000.0      30day        1000    100.0      30day        1000
1    Spark  22000.0      30day        1000  25000.0                   1400
2    Spark  25000.0                   1400    100.0      30day        1000
3    Spark  25000.0                   1400  25000.0                   1400
4  PySpark  25000.0     50days        2300  25000.0     50days        2300
5   Python  24000.0     40days        1200  24000.0     40days        1200
6   Python  24000.0     40days        1200  22000.0      5days        1600
7   Python  22000.0     50days        1600  24000.0     40days        1200
8   Python  22000.0     50days        1600  22000.0      5days        1600
9     None  25000.0      35day        1300  25000.0      35day        1300
--------left_on, right_on =[Courses,Discount]-----------
   Courses    Fee_x Duration_x  Discount    Fee_y Duration_y
0    Spark  22000.0      30day      1000    100.0      30day
1  PySpark  25000.0     50days      2300  25000.0     50days
2   Hadoop  23000.0     55days      1000      NaN        NaN
3   Python  24000.0     40days      1200  24000.0     40days
4   Pandas      NaN     60days      2500      NaN        NaN
5     None  25000.0      35day      1300  25000.0      35day
6    Spark  25000.0                 1400  25000.0
7   Python  22000.0     50days      1600  22000.0      5days

In [ ]:
# # pandas default join
# df3=df1.join(df2, lsuffix="_left", rsuffix="_right")

# # pandas Inner join DataFrames
# df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='inner')

# # pandas Right join DataFrames
# df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='right')

# # pandas outer join DataFrames
# df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='outer')

# # pandas join on columns
# df3=df1.set_index('Courses').join(df2.set_index('Courses'), how='inner')

In [119]:
# Iterate over Rows to perform an operation

# Pandas DataFrame offers two methods, iterrows() and itertuples(), for 
#      iterating over each row

df = pd.DataFrame(technologies, index=row_labels)

# Iterate all rows using DataFrame.iterrows()
print('-------------------------------------')
print('----------- iterrows() ----------')
print('<--->')
for index, row in df.iterrows():
    print(index, ' - ',row)
    print('<--->')
    #print(index, row['Fee'], row['Courses'])
print('-------------------------------------')

# Iterate all rows using DataFrame.itertuples()
print('-------------------------------------')
print('----------- itertuples() ----------')
for row in df.itertuples(index = True):
    print(row)
    #print (getattr(row,'Index'),getattr(row, "Fee"), getattr(row, "Courses"))
print('-------------------------------------')

-------------------------------------
----------- iterrows() ----------
<--->
r0  -  Courses       Spark
Fee         22000.0
Duration      30day
Discount       1000
Name: r0, dtype: object
<--->
r1  -  Courses     PySpark
Fee         25000.0
Duration     50days
Discount       2300
Name: r1, dtype: object
<--->
r2  -  Courses      Hadoop
Fee         23000.0
Duration     55days
Discount       1000
Name: r2, dtype: object
<--->
r3  -  Courses      Python
Fee         24000.0
Duration     40days
Discount       1200
Name: r3, dtype: object
<--->
r4  -  Courses     Pandas
Fee            NaN
Duration    60days
Discount      2500
Name: r4, dtype: object
<--->
r5  -  Courses        None
Fee         25000.0
Duration      35day
Discount       1300
Name: r5, dtype: object
<--->
r6  -  Courses       Spark
Fee         25000.0
Duration
Discount       1400
Name: r6, dtype: object
<--->
r7  -  Courses      Python
Fee         22000.0
Duration     50days
Discount       1600
Name: r7, dtype: object
<--->
-------------------------------------
-------------------------------------
----------- itertuples() ----------
Pandas(Index='r0', Courses='Spark', Fee=22000.0, Duration='30day', Discount=1000)
Pandas(Index='r1', Courses='PySpark', Fee=25000.0, Duration='50days', Discount=2300)
Pandas(Index='r2', Courses='Hadoop', Fee=23000.0, Duration='55days', Discount=1000)
Pandas(Index='r3', Courses='Python', Fee=24000.0, Duration='40days', Discount=1200)
Pandas(Index='r4', Courses='Pandas', Fee=nan, Duration='60days', Discount=2500)
Pandas(Index='r5', Courses=None, Fee=25000.0, Duration='35day', Discount=1300)
Pandas(Index='r6', Courses='Spark', Fee=25000.0, Duration='', Discount=1400)
Pandas(Index='r7', Courses='Python', Fee=22000.0, Duration='50days', Discount=1600)
-------------------------------------

In [120]:
# Read Excel file
#df = pd.read_excel('courses_schedule.xlsx')
#print(df)

In [121]:
# Write DataFrame to Excel file
#df.to_excel('Courses.xlsx')